ЦентраАдминистрированияСервер/src/DataProcessors/МониторингОшибокСинхронизации/МониторингОшибокСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МониторингОшибокСинхронизации</name>
</mdclass:DataProcessor>

ЦентраАдминистрированияСервер/src/InformationRegisters/СостояниеИнформационныхБаз/СостояниеИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеИнформационныхБаз</name>
  <resources>
    <name>SQLБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SQLСерверБазДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокировкаНачалаСеансов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрыБлокировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРезервнойКопии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонфигурацияИзменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущийРелиз</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МониторингОшибокСинхронизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЦентраАдминистрированияСервер/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

ЦентраАдминистрированияСервер/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
    <items>
      <name>МониторингОшибокСинхронизации</name>
      <description>Мониторинг ошибок синхронизации</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/DataProcessors/МониторингОшибокСинхронизации/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Заполняем список пользователей
	ЗаполнитьДанныеНаФорме()
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаФорме()
	
	//Заполняем список информационных баз
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеИнформационныхБаз.ИнформационнаяБаза КАК База
		|ИЗ
		|	РегистрСведений.СостояниеИнформационныхБаз КАК СостояниеИнформационныхБаз
		|ГДЕ
		|	СостояниеИнформационныхБаз.МониторингОшибокСинхронизации = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыПользователейСостав.Пользователь,
		|	ПользователиКонтактнаяИнформация.Значение КАК АдресЭП
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО ГруппыПользователейСостав.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ГруппыПользователейСостав.Ссылка = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.МониторингОшибокСинхронизации)
		|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	тзИнформационныеБазы 	= МассивРезультатов[0].Выгрузить();
	тзПользователи 						= МассивРезультатов[1].Выгрузить();
	
	СписокИнформационныхБаз.Загрузить(тзИнформационныеБазы);
	СписокПолучателей.Загрузить(тзПользователи);
	
	МониторингОшибокСинхронизации = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.МониторингОшибокСинхронизации);
	ИспользоватьМониторингОшибок = МониторингОшибокСинхронизации.Использование;
	ЧастотаПроверки = МониторингОшибокСинхронизации.Расписание.ПериодПовтораВТечениеДня / 60;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьДанныеНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	//////////////////////////////
	//ЗАПИСЬ СПИСКА БАЗ//
	//////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеИнформационныхБаз.ИнформационнаяБаза,
		|	ЛОЖЬ КАК МониторингОшибокСинхронизации
		|ПОМЕСТИТЬ ВТОтключитьМониторинг
		|ИЗ
		|	РегистрСведений.СостояниеИнформационныхБаз КАК СостояниеИнформационныхБаз
		|ГДЕ
		|	СостояниеИнформационныхБаз.МониторингОшибокСинхронизации = ИСТИНА
		|	И НЕ СостояниеИнформационныхБаз.ИнформационнаяБаза В (&СписокИнформационныхБаз)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза,
		|	ИСТИНА КАК МониторингОшибокСинхронизации
		|ПОМЕСТИТЬ ВТВключитьМониторинг
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.Ссылка В(&СписокИнформационныхБаз)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтключитьМониторинг.ИнформационнаяБаза,
		|	ВТОтключитьМониторинг.МониторингОшибокСинхронизации
		|ИЗ
		|	ВТОтключитьМониторинг КАК ВТОтключитьМониторинг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТВключитьМониторинг.ИнформационнаяБаза,
		|	ВТВключитьМониторинг.МониторингОшибокСинхронизации
		|ИЗ
		|	ВТВключитьМониторинг КАК ВТВключитьМониторинг";
	
	Запрос.УстановитьПараметр("СписокИнформационныхБаз", СписокИнформационныхБаз.Выгрузить());
	
	ВыборкаИнформационныхБаз = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИнформационныхБаз.Следующий() Цикл

		МенеджерЗаписиСостоянияБазы = РегистрыСведений.СостояниеИнформационныхБаз.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСостоянияБазы.ИнформационнаяБаза = ВыборкаИнформационныхБаз.ИнформационнаяБаза;
		МенеджерЗаписиСостоянияБазы.Прочитать();
		Если МенеджерЗаписиСостоянияБазы.Выбран() Тогда
			МенеджерЗаписиСостоянияБазы.МониторингОшибокСинхронизации = ВыборкаИнформационныхБаз.МониторингОшибокСинхронизации;
		Иначе
			МенеджерЗаписиСостоянияБазы.ИнформационнаяБаза = ВыборкаИнформационныхБаз.ИнформационнаяБаза;
			МенеджерЗаписиСостоянияБазы.МониторингОшибокСинхронизации = ВыборкаИнформационныхБаз.МониторингОшибокСинхронизации;
		КонецЕсли;
		
		МенеджерЗаписиСостоянияБазы.Записать(Истина);
		
	КонецЦикла;
	
	
	///////////////////////////////////////////////
	//ЗАПИСЬ СПИСКА ПОЛЬЗОВАТЕЛЕЙ//
	///////////////////////////////////////////////
	
	ОбъектГруппыМониторинга = Справочники.ГруппыПользователей.МониторингОшибокСинхронизации.ПолучитьОбъект();
	ОбъектГруппыМониторинга.Состав.Очистить();
	ОбъектГруппыМониторинга.Состав.Загрузить(СписокПолучателей.Выгрузить());
	ОбъектГруппыМониторинга.Записать();
	
	/////////////////////////////////
	//ЗАПИСЬ РЕГЛ ЗАДАНИЯ//
	/////////////////////////////////
	
	МониторингОшибокСинхронизации = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.МониторингОшибокСинхронизации);
	МониторингОшибокСинхронизации.Использование = ИспользоватьМониторингОшибок;
	МониторингОшибокСинхронизации.Расписание.ПериодПовтораВТечениеДня = ЧастотаПроверки * 60;
	МониторингОшибокСинхронизации.Расписание.ПериодПовтораДней = 1;
	МониторингОшибокСинхронизации.Записать();
	
КонецПроцедуры
